jmeter_project/reports/html_report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 401.0,
    "medianResTime" : 401.0,
    "minResTime" : 401.0,
    "maxResTime" : 401.0,
    "pct1ResTime" : 401.0,
    "pct2ResTime" : 401.0,
    "pct3ResTime" : 401.0,
    "throughput" : 2.493765586034913,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "Test Runner" : {
    "transaction" : "Test Runner",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 401.0,
    "medianResTime" : 401.0,
    "minResTime" : 401.0,
    "maxResTime" : 401.0,
    "pct1ResTime" : 401.0,
    "pct2ResTime" : 401.0,
    "pct3ResTime" : 401.0,
    "throughput" : 2.493765586034913,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  }
}